{
    "input": "",
    "if": "",
    "eq": "Compares to a passed value, and moves on if it's the same. Used with \"then\" and \"else\" ",
    "is": "@eq",
    "equals": "@eq",
    "equalto": "@eq",
    "isequal": "@eq",
    "isequalto": "@eq",
    "ne": "Compares to a passed value, and moves on if it is not the same. Used with \"then\" and \"else\" ",
    "neq": "@ne",
    "isnot": "@ne",
    "isnt": "@ne",
    "notequals": "@ne",
    "notequalto": "@ne",
    "gte": "Compares to a passed value, and moves on if it is greater than or equal to the value. Used with \"then\" and \"else\". ",
    "isgte": "@gte",
    "eg": "@gte",
    "ge": "@gte",
    "equalorgreaterthan": "@gte",
    "greaterthanorequalto": "@gte",
    "lte": "Compares to a passed value, and moves on if it is less then or equal to the value. Used with \"then\" and \"else\". ",
    "islte": "@lte",
    "le": "@lte",
    "el": "@lte",
    "lessthanorequalto": "@lte",
    "equaltoorlessthan": "@lte",
    "gt": "Compares to a passed value, and moves on if it is greater than the value. Used with \"then\" and \"else\". ",
    "isgt": "@gt",
    "greaterthan": "@gt",
    "isgreaterthan": "@gt",
    "lt": "Compares to a passed value, and moves on if it is less than the value. Used with \"then\" and \"else\".",
    "islt": "@lt",
    "lessthan": "@lt",
    "lowerthan": "@lt",
    "islessthan": "@lt",
    "islowerthan": "@lt",
    "ismember": "Checks if the user is a member of the specified group(s).",
    "memberof": "@ismember",
    "mo": "@ismember",
    "or": "Can be used to string output modifiers together with an \"OR\" relationship. ",
    "and": "Can be used to string output modifiers together with an \"AND\" relationship. ",
    "hide": "Will check earlier conditions, and hide the element if the conditions were met. ",
    "show": "Will check earlier conditions, and show the element if the conditions were met. ",
    "then": "Conditional usage. ",
    "else": "Conditional usage, together with then. ",
    "select": "",
    "cat": "Appends the option's value (if not empty) to the input value",
    "lcase": "Transforms strings to lowercase. Similar to PHP's strtolower",
    "lowercase": "@lcase",
    "strtolower": "@lcase",
    "ucase": "Transforms strings to uppercase. Similar to PHP's strtoupper",
    "uppercase": "@ucase",
    "strtoupper": "@ucase",
    "ucwords": "Transforms the first letter of a word to uppercase. Similar to PHP's ucwords",
    "ucfirst": "Transforms the first letter of the string to uppercase. Similar to PHP's ucfirst",
    "htmlent": "Replaces any character that has an HTML entity with that entity. Similar to PHP's htmlentities. Uses the current value the system setting \"modx_charset\" with flag ENT_QUOTES ",
    "htmlentities": "@htmlent",
    "esc": "Safely escapes character values using regex and str_replace. Also escapes [, ] and `",
    "escape": "@esc",
    "strip": "Replaces all linebreaks, tabs and multiple spaces with just one space",
    "stripString": "Strips string of specified value",
    "replace": "Replaces one value with another",
    "notags": "Removes HTML tags from the input. Optionally accepts a value to indicate which tags to allow. Similar to PHP's strip_tags",
    "striptags": "@notags",
    "stripTags": "@notags",
    "strip_tags": "@notags",
    "length": "Counts the length of the passed string. Similar to PHP's strlen",
    "len": "@length",
    "strlen": "@length",
    "reverse": "Reverses the input, character by character. Similar to PHP's strrev",
    "strrev": "@reverse",
    "wordwrap": "Inserts a newline character after the set amount of characters. Similar to PHP's wordwrap. Takes optional value to set wordwrap position.",
    "wordwrapcut": "Inserts a newline character after the set amount of characters, irrespective of word boundaries. Similar to PHP's wordwrap, with word cutting enabled. Takes optional value to set wordwrap position.",
    "limit": "Limits a string to a certain number of characters. Defaults to 100.",
    "ellipsis": "Adds an ellipsis to and truncates a string if it's longer than a certain number of characters. Defaults to 100.",
    "tag": "Displays the raw element without the :tag. Useful for documentation.",
    "add": "Returns input incremented by option (default: +1)",
    "increment": "@add",
    "incr": "@add",
    "subtract": "Returns input decremented by option (default: -1)",
    "decrement": "@subtract",
    "decr": "@subtract",
    "multiply": "Returns input multiplied by option (default: *2)",
    "mpy": "@multiply",
    "divide": "Returns input divided by option (default: /2) Does not accept 0.",
    "div": "@divide",
    "modulus": "Returns the option modulus on input (default: %2, returns 0 or 1)",
    "mod": "@modulus",
    "default": "Returns the input value if empty",
    "ifempty": "@default",
    "isempty": "@default",
    "empty": "@default",
    "ifnotempty": "Returns the input value if not empty",
    "isnotempty": "@ifnotempty",
    "notempty": "@ifnotempty",
    "!empty": "@ifnotempty",
    "nl2br": "Converts a new line character (\n) to an html element. Use this if you're taking in input, you think that there should be new lines in it, and there aren't. Similar to PHP's nl2br.",
    "date": "Formats a unix timestamp into a different format. Similar to PHP's strftime. Value is format. See Date Formats.",
    "strtotime": "Converts a date string into a unix timestamp. Useful to combine this with the date output filter. Similar to PHP's strtotime. Takes in a date. See Date Formats.",
    "fuzzydate": "Returns a pretty date format with yesterday and today being filtered. Takes in a date.",
    "ago": "Returns a pretty date format in seconds, minutes, weeks or months ago. Takes in a date (strtotime).",
    "md5": "Creates an MD5 hash of the input string. Similar to PHP's md5.",
    "cdata": "Wraps the text with CDATA tags",
    "userinfo": "Returns the requested user data. The element must be a modUser ID. The value field is the column to grab, e.g. fullname, email. See Examples below.",
    "isloggedin": "Returns true if user is authenticated in this context.",
    "isnotloggedin": "Returns true if user is not authenticated in this context.",
    "urlencode": "Converts the input into a URL-friendly string similar to how an HTML form would do so. Similar to PHP's urlencode",
    "urldecode": "Converts the input from an URL-friendly string Similar to PHP's urldecode",
    "toPlaceholder": "Puts the input value into the passed placeholder. Does not prevent the output of the value, so add :notempty=`` if you don't want to output the value.",
    "cssToHead": "Put a element into the head tag, where the input value is placed inside the href attribute. UsesmodX.regClientCSS.",
    "htmlToHead": "Insert a block of HTML code into the of the page, usually right before the . UsesmodX.regClientStartupHTMLBlock ",
    "htmlToBottom": "Insert HTML code into the bottom of the page, before . Uses modX.regClientHTMLBlock. ",
    "jsToHead": "Insert JS code (or a link) into the head tag (before the closing head tag). UsesmodX.regClientStartupScript. ",
    "jsToBottom": "Insert JS code (or a link) before the closing body tag of the page. Uses modX.regClientScript. "
}